{
  "title": "Congregational Prayer",
  "sections": [
    {
      "type": "section_title",
      "text": "Sunnah of Congregational Prayer"
    },
    {
      "type": "paragraph",
      "text": "Praying in congregation (more than one person) is a confirmed sunnah. Men should pray the obligatory prayers in a masjid (mosque) unless there is a valid excuse for not doing so. Although it is preferred that women pray at home, they may attend prayers in mosques and can pray in congregation in their houses or elsewhere when possible."
    },
    {
      "type": "section_title",
      "text": "Tahiyyatul-Masjid"
    },
    {
      "type": "paragraph",
      "text": "Upon entering a masjid, one should pray two rak‘ahs before being seated unless the people have already stood up for an obligatory prayer. This prayer is called tahiyyatul-masjid (greeting of the mosque)."
    },
    {
      "type": "section_title",
      "text": "Imam & Positioning"
    },
    {
      "type": "paragraph",
      "text": "A male imam stands alone in front of his followers, while a woman leading other women in prayer stands in the middle of the first row. If there is only one follower, he stands to the right of the imam."
    },
    {
      "type": "section_title",
      "text": "Straight Rows & Attention"
    },
    {
      "type": "paragraph",
      "text": "Rows should be straight with worshippers standing shoulder to shoulder, leaving no gaps. It is obligatory to listen to and follow the imam, i.e., not to make any movement during the prayer until after he has done so."
    },
    {
      "type": "section_title",
      "text": "Behavior When Arriving Late"
    },
    {
      "type": "paragraph",
      "text": "One should not run to join the congregation if he is late but walk calmly and try to avoid passing directly in front of those praying. If one arrives after the prayer has begun, he joins in immediately by saying, “Allahu akbar,” raising his hands to the level of his shoulders or ears and assuming the position of those praying. He then completes the remaining portion of the prayer with the congregation."
    },
    {
      "type": "section_title",
      "text": "Making Up Missed Rak‘ahs"
    },
    {
      "type": "list",
      "items": [
        "If he finds that he has missed any of its rak‘ahs, he remains in the sitting position (julus) until after the imam has pronounced the salam (without making the salam himself), stands up, and completes the missing rak‘ahs.",
        "If he joined the prayer up through the time of ruku‘, that rak‘ah is counted as complete. But if he joined after ruku‘ (i.e., during i‘tidal, sujud or julus), the rak‘ah must be repeated.",
        "Missed rak‘ahs in which there is recitation of Qur’an after al-Fātiḥah should be made up accordingly."
      ]
    }
  ]
}
