{
  "title": "Hajj Guide",
  "sections": [
    {
      "type": "section_title",
      "text": "Preparation & Intention"
    },
    {
      "type": "paragraph",
      "text": "Several days before departure, you prepare your heart and luggage alike. Inwardly, you make your niyyah: “O Allah, I intend to perform Hajj purely for Your sake, seeking Your pleasure.” Outwardly, you ensure your paperwork, vaccinations, and travel plans are in order."
    },
    {
      "type": "section_title",
      "text": "Entering Ihram & Performing Umrah"
    },
    {
      "type": "paragraph",
      "text": "Upon reaching the Miqāt boundary, you don the two unstitched white sheets of ihram (men) or modest plain dress (women). No perfume, no cutting hair or nails, no marital intimacy. With hands raised in reverence, you chant the Talbiyah: “Labbayka Allāhumma labbayk… Here I am, O Allah, here I am!” On arrival at Masjid al-Ḥaram, you circle the Ka‘bah seven times (tawāf), pausing at the Black Stone to touch or kiss it if possible, whispering “Allāhu Akbar.” Next, you walk and run between Safa and Marwah seven times (sa‘y), honoring Hajar’s desperate search. When your seventh lap ends, men clip or shave their hair; women trim a fingertip’s length. This completes your Umrah and releases you briefly from ihram’s restrictions, though you remain spiritually consecrated for Hajj."
    },
    {
      "type": "section_title",
      "text": "Return to Makkah & Rest"
    },
    {
      "type": "paragraph",
      "text": "Back in town, you rest, pray in the Grand Mosque, and sip Zamzam water. You reflect on Ibrahim’s legacy and prepare your spirit for the days ahead. On the 8th of Dhul Ḥijjah, you will re-enter ihram, renewing your intention for the major pilgrimage."
    },
    {
      "type": "section_title",
      "text": "Mina (8 Dhul Ḥijjah)"
    },
    {
      "type": "paragraph",
      "text": "At dawn on the 8th, you journey to Mina—an eight-kilometer caravan of white. There you shorten the four-unit prayers to two (qaṣr), stand in worship amidst tens of thousands, and spend the day supplicating under the relentless sun."
    },
    {
      "type": "section_title",
      "text": "ʿArafah (9 Dhul Ḥijjah)"
    },
    {
      "type": "paragraph",
      "text": "After Fajr, you depart for the plain of ʿArafah. From midday until sunset, you stand in the blistering heat, combining Ẓuhr and ʿAṣr behind the Imām, listening to the sermon at Jabal al-Nimrah, and beseeching Allah: “There is no day on which Allah frees more people from Hellfire than the Day of ʿArafah.” — Ṣaḥīḥ Muslim"
    },
    {
      "type": "section_title",
      "text": "Muzdalifah (Night of 9 Dhul Ḥijjah)"
    },
    {
      "type": "paragraph",
      "text": "At sunset you move to Muzdalifah. Beneath an open sky, you combine Maghrib and ʿIshā’ prayers and collect at least 70 small pebbles. You rest briefly, the earth your mattress, steel-cold air your blanket."
    },
    {
      "type": "section_title",
      "text": "Rami al-Jamarāt (10 Dhul Ḥijjah)"
    },
    {
      "type": "paragraph",
      "text": "Before dawn, you return to Mina. After Fajr, you throw seven stones at the largest pillar (al-Aqabah), saying “Allāhu Akbar” with each pebble—symbolizing Ibrahim’s rejection of Satan. You then sacrifice an animal (hady), sharing meat with the needy, and shave or trim your hair (men shave completely; women clip)."
    },
    {
      "type": "section_title",
      "text": "Tawāf al-Ifāḍah & Sa‘y (10 Dhul Ḥijjah)"
    },
    {
      "type": "paragraph",
      "text": "Back in Makkah, you perform the essential tawāf of Ifāḍah—seven circuits—then repeat the rustic sa‘y. These rites, combined with your sacrifice and stoning, fulfill the core of Hajj."
    },
    {
      "type": "section_title",
      "text": "2nd & 3rd Days of Rami (11–12 Dhul Ḥijjah)"
    },
    {
      "type": "paragraph",
      "text": "You return to Mina for two more mornings of stoning. Each day you lob seven pebbles at each of the three pillars in sequence, maintaining calm and remembering Ibrahim’s steadfastness."
    },
    {
      "type": "section_title",
      "text": "Farewell Tawāf (Tawāf al-Widā’)"
    },
    {
      "type": "paragraph",
      "text": "Before departing Makkah, you circle the Ka‘bah one last time. Some perform two rak‘ahs afterward and sip Zamzam water, sealing your journey with tears of gratitude."
    },
    {
      "type": "section_title",
      "text": "Eid al-Adha & Beyond"
    },
    {
      "type": "paragraph",
      "text": "Even if you cannot reach Hajj, the first ten days of Dhul Ḥijjah remain a golden opportunity—fast, give charity, glorify Allah with takbīr and tahleel, and pray that He grants you this blessed pilgrimage in the future. Hajj Mabroor — may your pilgrimage be accepted and your sins washed away."
    }
  ]
}
