{
  "title": "Forgetfulness Prostration",
  "sections": [
    {
      "type": "section_title",
      "text": "Definition"
    },
    {
      "type": "paragraph",
      "text": "Sujud as-sahu compensates for certain mistakes so that the prayer need not be repeated. It is two prostrations which are made at the end of the prayer either before the salam or after it. Both ways were done by the Prophet (ﷺ). According to the type of error – whether omission, addition or doubt.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "Sujud as-sahu compensates for certain mistakes so that the prayer need not be repeated. It is two prostrations which are made at the end of the prayer either before the salam or after it. Both ways were done by the Prophet ("
        },
        {
          "type": "arabic_text",
          "text": "ﷺ",
          "font": "Noto Kufi Arabic"
        },
        {
          "type": "english_text",
          "text": "). According to the type of error – whether omission, addition or doubt."
        }
      ]
    },
    {
      "type": "section_title",
      "text": "Recitation"
    },
    {
      "type": "paragraph",
      "text": "“What is to be said in Sujud As-Sahw is the same as what is to be said in the sujud of prayer, which is to say Subhana Rabbi al-A’la (Glory be to my Lord Most High) or other tasbihat which are reported as being sunnah to say in sujud.”"
    },
    {
      "type": "section_title",
      "text": "Prescribed Cases"
    },
    {
      "type": "list",
      "items": [
        "Forgetting to sit for the first tashahhud.",
        "Doubt about how many rak‘ahs one has done – here he assumes the lesser number and continues until he is certain the prayer is not incomplete, then performs the sujud at the end.",
        "Forgetfully making the salam before the prayer is complete – the missing rak‘ahs are performed and followed by the sujud.",
        "Mistakenly praying an extra rak‘ah (if one remembers or has been informed of it)."
      ]
    }
  ]
}