{
  "title": "Ghusl Guide",
  "sections": [
    {
      "type": "section_title",
      "text": "JANĀBAH GHUSL (Major Impurity)"
    },
    {
      "type": "paragraph",
      "text": "“Whenever the Prophet ﷺ took a bath after Janaba, he started by washing his hands and then performed ablution like that for the prayer. After that he put his fingers in water and moved the roots of his hair with them, then poured three handfuls of water over his head and then poured water all over his body.” (Sahih al‑Bukhari 248)",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "“Whenever the Prophet ﷺ"
        },
        {
          "type": "english_text",
          "text": "took a bath after Janaba, he started by washing his hands and then performed ablution like that for the prayer. After that he put his fingers in water and moved the roots of his hair with them, then poured three handfuls of water over his head and then poured water all over his body.” (Sahih al‑Bukhari 248)"
        }
      ]
    },
    {
      "type": "subheading",
      "text": "Procedure"
    },
    {
      "type": "list",
      "items": [
        "Niyyah (Intention): In your heart, “I intend to purify myself from the state of major ritual impurity (janaba) for the sake of Allah.”",
        "Wash both hands up to the wrists three times.",
        "Cleanse the private parts thoroughly and remove any traces of impurity.",
        "Perform a complete wudu (ablution) as for prayer.",
        "Pour water over your head three times, ensuring the water reaches the roots of the hair.",
        "Pour water over the right side of your body three times, rubbing to ensure all skin is wet.",
        "Pour water over the left side of your body three times, as above.",
        "Pass wet hands over every part of your body to be sure no spot is left dry.",
        "Wash your feet if you did not do so during wudu."
      ]
    },
    {
      "type": "section_title",
      "text": "HAID GHUSL (Menstrual Impurity)"
    },
    {
      "type": "paragraph",
      "text": "“Asma, daughter of Shakal, asked the Messenger of Allah ﷺ about washing after menstruation. He said: ‘Everyone amongst you should use water (mixed with the leaves of the lote‑tree) and cleanse herself well, then pour water on her head and rub it vigorously until it reaches the roots of the hair. Then she should pour water on it. Afterwards she should take a piece of cotton smeared with musk and cleanse herself with it.’” (Sahih Muslim 332c)",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "“Asma, daughter of Shakal, asked the Messenger of Allah ﷺ"
        },
        {
          "type": "english_text",
          "text": "about washing after menstruation. He said: ‘Everyone amongst you should use water (mixed with the leaves of the lote‑tree) and cleanse herself well, then pour water on her head and rub it vigorously until it reaches the roots of the hair. Then she should pour water on it. Afterwards she should take a piece of cotton smeared with musk and cleanse herself with it.’” (Sahih Muslim 332c)"
        }
      ]
    },
    {
      "type": "subheading",
      "text": "Procedure"
    },
    {
      "type": "list",
      "items": [
        "Niyyah (Intention): In your heart, “I intend to purify myself from menstrual impurity (haidh) for the sake of Allah.”",
        "Repeat steps 2–9 from the Janabah Ghusl procedure above.",
        "After bathing, you may wipe the site of bleeding with a piece of cloth lightly scented with musk (mustahabb)."
      ]
    },
    {
      "type": "section_title",
      "text": "NIFĀS GHUSL (Postpartum Bleeding)"
    },
    {
      "type": "paragraph",
      "text": "“It was narrated from Jabir bin ‘Abdullah that the Messenger of Allah ﷺ said to Abu Bakr regarding Asma’ bint ‘Umair, when she gave birth in Dhul‑Hulaifah: ‘Tell her to perform ghusl and enter ihram.’” (Sunan an‑Nasa’i 214)",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "“It was narrated from Jabir bin ‘Abdullah that the Messenger of Allah ﷺ"
        },
        {
          "type": "english_text",
          "text": "said to Abu Bakr regarding Asma’ bint ‘Umair, when she gave birth in Dhul‑Hulaifah: ‘Tell her to perform ghusl and enter ihram.’” (Sunan an‑Nasa’i 214)"
        }
      ]
    },
    {
      "type": "subheading",
      "text": "Scholarly Ruling"
    },
    {
      "type": "paragraph",
      "text": "Once postpartum bleeding stops, ghusl is obligatory so that prayer and marital relations may be resumed."
    },
    {
      "type": "subheading",
      "text": "Procedure"
    },
    {
      "type": "list",
      "items": [
        "Niyyah (Intention): In your heart, “I intend to purify myself from postpartum bleeding impurity (nifas) for the sake of Allah.”",
        "Repeat steps 2–9 from the Janabah Ghusl procedure above."
      ]
    }
  ]
}