{
  "title": "Historical Overview",
  "sections": [
    {
      "type": "section_title",
      "text": "Story of Hajj"
    },
    {
      "type": "paragraph",
      "text": "Long before the Prophet Muhammad (peace be upon him) re-established it in 628 CE, the rites of Hajj trace back to Prophet Ibrahim (AS). In obedience to the command of Allah (Qur’an 2:125), Ibrahim left his wife Hajar and infant son Isma‘il alone in the barren valley of Makkah. Their trial tested faith, patience and reliance upon God."
    },
    {
      "type": "paragraph",
      "text": "Each year Ibrahim returned to the small stone structure he and Isma‘il had built around the newly sprung well of Zamzam. Over centuries the Ka‘bah became a center for polytheistic worship, its walls lining with idols of the pre-Islamic Arabs. Yet in Dhul Hijjah fighting ceased and pilgrims still came, circling the black cloth-draped cube in hopes of mercy."
    },
    {
      "type": "paragraph",
      "text": "In 630 CE, Muhammad ﷺ cleansed the Ka‘bah of idols and restored it as Baitullah—the House of Allah (Qur’an 3:96). From then on the pilgrimage returned to its original purpose: a testament to monotheism, unity and surrender to God.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "In 630 CE, Muhammad "
        },
        {
          "type": "arabic_text",
          "text": "ﷺ",
          "font": "Noto Kufi Arabic"
        },
        {
          "type": "english_text",
          "text": " cleansed the Ka‘bah of idols and restored it as Baitullah—the House of Allah (Qur’an 3:96). From then on the pilgrimage returned to its original purpose: a testament to monotheism, unity and surrender to God."
        }
      ]
    },
    {
      "type": "section_title",
      "text": "The Well of Zamzam"
    },
    {
      "type": "paragraph",
      "text": "Stranded and near death, Hajar ran seven times between the hills of Safa and Marwah in desperate search for water. At her son’s crying, a spring gushed forth beneath his heel—an enduring miracle now known as the Well of Zamzam. Its cool waters became a lifeline for their small settlement and a symbol of tawakkul (complete trust in Allah)."
    },
    {
      "type": "paragraph",
      "text": "Pilgrims today still draw Zamzam water to quench body and soul, recalling how divine mercy arrived at the moment of greatest need."
    },
    {
      "type": "section_title",
      "text": "Building the Ka‘bah"
    },
    {
      "type": "paragraph",
      "text": "Upon that very spring’s banks, Ibrahim (AS) and young Isma‘il raised the first Ka‘bah—a humble cuboid altar to one God. Its dimensions and orientation were divinely guided, setting a qiblah toward which all Muslims would one day face in prayer."
    },
    {
      "type": "paragraph",
      "text": "﴿2:144 We have certainly seen the turning of your face, [O Muhammad], toward the heaven, and We will surely turn you to a qiblah with which you will be pleased. So turn your face toward al-Masjid al-Haram. And wherever you [believers] are, turn your faces toward it [in prayer]. Indeed, those who have been given the Scripture well know that it is the truth from their Lord. And Allah is not unaware of what they do.﹄",
      "formatted_text": [
        {
          "type": "arabic_text",
          "text": "﴿",
          "font": "Noto Kufi Arabic"
        },
        {
          "type": "english_text",
          "text": "2:144 We have certainly seen the turning of your face, [O Muhammad], toward the heaven, and We will surely turn you to a qiblah with which you will be pleased. So turn your face toward al-Masjid al-Haram. And wherever you [believers] are, turn your faces toward it [in prayer]. Indeed, those who have been given the Scripture well know that it is the truth from their Lord. And Allah is not unaware of what they do.﹄"
        }
      ]
    },
    {
      "type": "paragraph",
      "text": "Over generations the simple sanctuary was lost and rebuilt by tribes who left it roofless, sheltered idols within, and raised its door to fend off floods. Yet beneath each layer lay the legacy of Ibrahim’s unwavering obedience."
    },
    {
      "type": "section_title",
      "text": "Inception to Modern Hajj"
    },
    {
      "type": "paragraph",
      "text": "When Muhammad ﷺ performed the first post-revelation pilgrimage in 632 CE, he walked the same tawaf path and ran between Safa and Marwah, linking Islam’s new era to Ibrahim’s ancient covenant. Today, more than 2.5 million pilgrims don unstitched garments of ihram, stand shoulder to shoulder in the Grand Mosque, and relive those foundational moments of faith every Dhul Hijjah.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "When Muhammad "
        },
        {
          "type": "arabic_text",
          "text": "ﷺ",
          "font": "Noto Kufi Arabic"
        },
        {
          "type": "english_text",
          "text": " performed the first post-revelation pilgrimage in 632 CE, he walked the same tawaf path and ran between Safa and Marwah, linking Islam’s new era to Ibrahim’s ancient covenant. Today, more than 2.5 million pilgrims don unstitched garments of ihram, stand shoulder to shoulder in the Grand Mosque, and relive those foundational moments of faith every Dhul Hijjah."
        }
      ]
    },
    {
      "type": "paragraph",
      "text": "The rites—tawaf, sa‘y, standing in ‘Arafah, stoning the Jamarat, and sacrificing an animal—remain unchanged. Each step cleanses sins, humbles the soul, and reaffirms mankind’s submission to Allah."
    },
    {
      "type": "section_title",
      "text": "The Ka‘bah Through Time"
    },
    {
      "type": "paragraph",
      "text": "Throughout Islamic history, rulers from the Quraysh to the Ottomans have expanded and rebuilt the mosque that surrounds the Ka‘bah. In 1631, after catastrophic floods, Sultan Sulayman the Magnificent oversaw a complete reconstruction. Modern Saudi expansions have added steel and marble, seven minarets and the gilded door installed in 1982."
    },
    {
      "type": "paragraph",
      "text": "Despite these changes, the Ka‘bah’s dimensions—15 m tall and roughly 10.5 m on each side—still echo the humble shrine Ibrahim and Isma‘il raised by divine command."
    },
    {
      "type": "section_title",
      "text": "Prayer, Pilgrimage and Miracles"
    },
    {
      "type": "paragraph",
      "text": "Each day Muslims turn toward this sacred cube, their hearts anchored in Surah 2:144’s promise: the five daily prayers and the once-in-a-lifetime Hajj form the twin pillars of divine connection."
    },
    {
      "type": "paragraph",
      "text": "Beyond the Qur’an itself—an everlasting miracle—numerous hadiths recall the Prophet’s own wonders: the splitting of the moon, the Night Journey to Jerusalem, the springing of Zamzam, rain at Tabuk, and angels aiding him in battle. These narratives remind us that God’s care extends from cosmic signs to personal deliverance."
    }
  ]
}