{
  "title": "Janazah Prayer",
  "sections": [
    {
      "type": "section_title",
      "text": "Eligibility & Requirements"
    },
    {
      "type": "paragraph",
      "text": "When a Muslim dies, it is the duty of the community that janazah prayer is held for him by some (at least one) of its members, but the more the better. Janazah prayer is conducted standing throughout, without ruku', sujud or julus. It can be conducted at any time. Wudhu’, adequate covering of the body, and facing the qiblah are required, as in any prayer."
    },
    {
      "type": "section_title",
      "text": "Placement & Position"
    },
    {
      "type": "paragraph",
      "text": "The body (or bodies) is placed between the imam and the qiblah. The imam stands opposite the head if the deceased is a man, and opposite the waist if it is a woman. If there are both sexes among the deceased the men are placed nearest the imam, the women nearest the qiblah. An-Nasa’i related the witness of four companions to the fact that this is a sunnah from a sound chain."
    },
    {
      "type": "section_title",
      "text": "Prayer Procedure"
    },
    {
      "type": "list",
      "items": [
        "Takbir 1: After niyyah (intention) the imam, followed by the congregation, raises his hands to shoulder-ear level and says “Allahu akbar,” placing his hands on his chest, then recites al-Fatihah silently.",
        {
          "text": "Takbir 2: He says “Allahu akbar” again, raises his hands, then recites silently the prayer for blessings upon the Prophet (ﷺ).",
          "formatted_text": [
            {
              "type": "english_text",
              "text": "Takbir 2: He says “Allahu akbar” again, raises his hands, then recites silently the prayer for blessings upon the Prophet (ﷺ"
            },
            {
              "type": "english_text",
              "text": ")."
            }
          ]
        },
        "Takbir 3: Saying “Allahu akbar” for the third time (raising hands), he then recites du'a’s taken from the sunnah—either aloud or silently—or, if none are memorized, any supplication for the deceased.",
        "Takbir 4: After “Allahu akbar” a fourth time, he continues du'a’ briefly, concluding with taslim (salam), said once to the right or twice as in regular prayers."
      ]
    },
    {
      "type": "section_title",
      "text": "Supplication for the Deceased"
    },
    {
      "type": "paragraph",
      "text": "اللهم اغفر له، وارحمه، وعافه، واعفُ عنه، وأكرم نُزُله، ووسّع مُدخله،\nواغسله بالماء والثلج والبرد، ونقِّه من الخطايا كما نقَّيتَ الثوبَ الأبيضَ من الدَّنس،\nوأبدله دارًا خيرًا من داره، وأهلاً خيرًا من أهله، وزوجًا خيرًا من زوجه،\nوأدخله الجنةَ، وَأَعِذْهُ من عذاب القبر، أو من عذاب النار",
      "formatted_text": [
        {
          "type": "arabic_text",
          "text": "اللهم اغفر له، وارحمه، وعافه، واعفُ عنه، وأكرم نُزُله، ووسّع مُدخله،\nواغسله بالماء والثلج والبرد، ونقِّه من الخطايا كما نقَّيتَ الثوبَ الأبيضَ من الدَّنس،\nوأبدله دارًا خيرًا من داره، وأهلاً خيرًا من أهله، وزوجًا خيرًا من زوجه،\nوأدخله الجنةَ، وَأَعِذْهُ من عذاب القبر، أو من عذاب النار",
          "font": "Noto Kufi Arabic"
        }
      ]
    },
    {
      "type": "paragraph",
      "text": "“O Allah, forgive him, have mercy on him, grant him well-being, pardon him, honour his resting-place, expand his entrance, wash him with water, ice and hail, cleanse him of sins as a white garment is cleansed of dirt, replace his home with a better one, his family with a better one, his spouse with a better spouse, admit him to Paradise, and protect him from the punishment of the grave and the Fire.”"
    },
    {
      "type": "section_title",
      "text": "Prayer for the Absent"
    },
    {
      "type": "paragraph",
      "text": "If it is not possible to perform janazah on someone present, the same prayer may be offered in absence by an imam and congregation. It was related in authentic hadiths that the Prophet (ﷺ) did this upon the death of an-Najashi in Abyssinia. The procedure is identical except that the bodies are not present before the imam.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "If it is not possible to perform janazah on someone present, the same prayer may be offered in absence by an imam and congregation. It was related in authentic hadiths that the Prophet (ﷺ"
        },
        {
          "type": "english_text",
          "text": ") did this upon the death of an-Najashi in Abyssinia. The procedure is identical except that the bodies are not present before the imam."
        }
      ]
    }
  ]
}