{
  "title": "Kusuf Prayer",
  "sections": [
    {
      "type": "section_title",
      "text": "Overview"
    },
    {
      "type": "paragraph",
      "text": "A special prayer during a solar or lunar eclipse—whether total or partial—is a confirmed sunnah in authentic hadiths (al-Bukhari, Muslim, et al.). It consists of two rak‘ahs, each containing two prolonged ruku‘s. It is preferable to pray in congregation but may be offered individually."
    },
    {
      "type": "section_title",
      "text": "Method"
    },
    {
      "type": "paragraph",
      "text": "Niyyah & Beginning: Form the intention for the eclipse prayer. Begin as in any other prayer: stand (qiyam), say “Allahu akbar,” and perform the opening takbir."
    },
    {
      "type": "section_title",
      "text": "First Rak‘ah"
    },
    {
      "type": "list",
      "items": [
        "Qiyam & Recitation: Recite Surat al-Fatihah and then a long portion of the Qur’an, prolonging both.",
        "First Ruku‘: Bow (ruku‘) and prolong it.",
        "Return to Qiyam: Stand up, say “Rabbana wa laka-l-hamd,” then recite al-Fatihah again followed by another long portion of the Qur’an (slightly shorter than before).",
        "Second Ruku‘: Bow for a second prolonged ruku‘.",
        "Sujud & Completion: Complete the rak‘ah as usual, prolonging the prostration (sujud)."
      ]
    },
    {
      "type": "section_title",
      "text": "Second Rak‘ah"
    },
    {
      "type": "paragraph",
      "text": "Repeat the same sequence as the first rak‘ah: long qiyam with recitation, two prolonged ruku‘s, and extended prostrations. End with the sitting (julus) and taslim (salam) as in ordinary prayer."
    },
    {
      "type": "section_title",
      "text": "Sunnah Extensions"
    },
    {
      "type": "paragraph",
      "text": "Prolong the entire prayer for the duration of the eclipse. If the eclipse ends sooner, use the remaining time for dhikr, du‘a’, and seeking forgiveness."
    },
    {
      "type": "section_title",
      "text": "Charity (Ṣadaqah)"
    },
    {
      "type": "paragraph",
      "text": "The Prophet (ﷺ) prescribed giving charity at the time of the eclipse prayer as an additional sunnah.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "The Prophet ("
        },
        {
          "type": "arabic_text",
          "text": "ﷺ",
          "font": "Noto Kufi Arabic"
        },
        {
          "type": "english_text",
          "text": ") prescribed giving charity at the time of the eclipse prayer as an additional sunnah."
        }
      ]
    }
  ]
}