{
  "title": "Prayer While Traveling",
  "sections": [
    {
      "type": "section_title",
      "text": "Distance"
    },
    {
      "type": "paragraph",
      "text": "No specific distance for a trip is given in the sunnah, although some scholars have suggested a definition of 80 km."
    },
    {
      "type": "section_title",
      "text": "Shorten & Join"
    },
    {
      "type": "paragraph",
      "text": "During travels one is allowed to shorten four-rak‘ah prayers, omitting the last two rak‘ahs and making the salam after the second rak‘ah. He may also join Thuhr and ‘Asr prayers—praying both consecutively (two rak‘ahs each) any time during the period of Thuhr or ‘Asr. Likewise, he may pray Maghrib (three rak‘ahs) and ‘Isha’ (two rak‘ahs) any time during the period of Maghrib or ‘Isha’. Fajr is prayed as usual. It is permissible for the traveler to join prayers whether he is on the move or has made a temporary stop, but if one intends to settle in a place for some time, he should not join them."
    },
    {
      "type": "section_title",
      "text": "Duration"
    },
    {
      "type": "paragraph",
      "text": "The scholars differed concerning the length of time during which, when a traveler stays in one place, he may shorten his prayers. But the practice of the Prophet (ﷺ) and his companions after him was to continue to shorten four-rak‘ah prayers (without joining them) indefinitely as long as they were waiting to return home.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "The scholars differed concerning the length of time during which, when a traveler stays in one place, he may shorten his prayers. But the practice of the Prophet (ﷺ"
        },
        {
          "type": "english_text",
          "text": ") and his companions after him was to continue to shorten four-rak‘ah prayers (without joining them) indefinitely as long as they were waiting to return home."
        }
      ]
    },
    {
      "type": "section_title",
      "text": "Sunnah Prayers"
    },
    {
      "type": "paragraph",
      "text": "Among sunnah prayers, only Fajr sunnah and Witr were maintained by the Prophet (ﷺ) during a journey, and he did not pray the rawatib of Thuhr, ‘Asr, Maghrib or ‘Isha’ when joining prayers. However, the majority of scholars are of the opinion that it is not disliked to perform nawafil during a journey in which one is shortening his salah.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "Among sunnah prayers, only Fajr sunnah and Witr were maintained by the Prophet (ﷺ"
        },
        {
          "type": "english_text",
          "text": ") during a journey, and he did not pray the rawatib of Thuhr, ‘Asr, Maghrib or ‘Isha’ when joining prayers. However, the majority of scholars are of the opinion that it is not disliked to perform nawafil during a journey in which one is shortening his salah."
        }
      ]
    },
    {
      "type": "section_title",
      "text": "Prayer in Transport"
    },
    {
      "type": "list",
      "items": [
        "Fear that the time for the obligatory prayer will end before reaching the destination.",
        "The impossibility of standing and facing the qiblah."
      ]
    },
    {
      "type": "paragraph",
      "text": "If it is possible to stop and pray normally, that must be done."
    }
  ]
}