{
  "title": "Umrah Guide",
  "sections": [
    {
      "type": "section_title",
      "text": "Intention (Niyyah)"
    },
    {
      "type": "paragraph",
      "text": "Before crossing the Miqat boundary (the designated points around Makkah), quietly form in your heart: “O Allah, I intend to perform Hajj purely for Your sake, seeking Your pleasure.”"
    },
    {
      "type": "section_title",
      "text": "Entering the State of Ihram"
    },
    {
      "type": "list",
      "items": [
        "Men: Two unstitched white sheets (rida' over the shoulder; izar around the waist), no head covering.",
        "Women: Any modest, loose clothing covering everything except face and hands; no gloves or face veil."
      ]
    },
    {
      "type": "section_title",
      "text": "Restrictions"
    },
    {
      "type": "list",
      "items": [
        "No cutting hair or nails.",
        "No perfume or scented soaps.",
        "No marital intimacy.",
        "No hunting, arguing, or violence."
      ]
    },
    {
      "type": "section_title",
      "text": "Talbiyah"
    },
    {
      "type": "paragraph",
      "text": "With hands raised, begin chanting: لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ… \"Here I am, O Allah, here I am!\" Continue repeating it throughout your journey into Makkah.",
      "formatted_text": [
        {
          "type": "english_text",
          "text": "With hands raised, begin chanting: "
        },
        {
          "type": "arabic_text",
          "text": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ…",
          "font": "Noto Kufi Arabic"
        },
        {
          "type": "english_text",
          "text": " \"Here I am, O Allah, here I am!\" Continue repeating it throughout your journey into Makkah."
        }
      ]
    },
    {
      "type": "section_title",
      "text": "Tawāf (Circumambulation)"
    },
    {
      "type": "paragraph",
      "text": "Location: The Mataf, the open courtyard around the Ka‘bah."
    },
    {
      "type": "list",
      "items": [
        "Stand facing the Black Stone (al-Hajar al-Aswad).",
        "Say “Allahu Akbar” and touch or point toward the Black Stone.",
        "Begin your first of seven circuits, keeping the Ka‘bah on your left.",
        "Men may briskly walk the first three rounds (riql); women proceed at normal pace.",
        "After each circuit, you may recite any du‘a’ or quietly reflect on Allah’s mercy."
      ]
    },
    {
      "type": "section_title",
      "text": "Prayer at Maqām Ibrāhīm"
    },
    {
      "type": "paragraph",
      "text": "After your seventh circuit, proceed to the small enclosed chamber called Maqam Ibrahim. There, pray two rak‘ahs quietly, reciting Surat al-Fatihah and another short surah."
    },
    {
      "type": "section_title",
      "text": "Zamzam Water"
    },
    {
      "type": "paragraph",
      "text": "Drink deeply from the Zamzam well—its water is praised in Sahih Muslim: “The water of Zamzam is for whatever it is drunk for.” Use this moment to make heartfelt du‘a’."
    },
    {
      "type": "section_title",
      "text": "Sa‘y (Running Between Safa & Marwah)"
    },
    {
      "type": "list",
      "items": [
        "Start at Safa: Climb onto its small platform, face the Ka‘bah, and recite “Indeed, Safa and Marwah are among the symbols of Allah.” (Qur’an 2:158).",
        "Seven Laps: Walk to Marwah (green markers identify the riql zone), then return to Safa. Repeat until you finish seven.",
        "Reflection: Recall Hajar’s desperation and celebrate Allah’s provision."
      ]
    },
    {
      "type": "section_title",
      "text": "Shaving or Trimming Hair (Tahlīl)"
    },
    {
      "type": "list",
      "items": [
        "Men: Shave head completely (preferred) or trim evenly.",
        "Women: Clip a fingertip’s length from all over."
      ]
    },
    {
      "type": "section_title",
      "text": "Exiting Ihram & Final Supplications"
    },
    {
      "type": "paragraph",
      "text": "Once clipped or shaved, you may change into regular clothes, wear fragrance again, and resume normal activities (marital relations remain suspended until Hajj’s end if you’re staying for both). Conclude by offering voluntary prayers and thanking Allah for accepting your worship."
    },
    {
      "type": "section_title",
      "text": "Tips for a Blessed Umrah"
    },
    {
      "type": "list",
      "items": [
        "Timing: Many pilgrims choose early morning (Fajr) or just before Maghrib to avoid crowds.",
        "Spiritual Focus: Keep your tongue moist with remembrance—takbir, tahmid, and du‘a’.",
        "Physical Preparation: Break in sandals, stay hydrated, and pace yourself—especially during sa‘y’s riql section.",
        "Group Etiquette: Respect personal space; assist elders and the less able."
      ]
    }
  ]
}